src/МЗ_ОС_Услуги/АБК_ПоступлениеТРУ_ЗачетАвансаПоДокументамИОстаткам/Documents/ФормированиеВложенийВФинансовыеАктивы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ФормированиеВложенийВФинансовыеАктивы</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ЗачетАвансовПоДокументамИОстаткам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументАванса</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручение</v8:Type>
								<v8:Type>cfg:DocumentRef.КассовоеВыбытие</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ОперацияБух</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаНаКассовыйРасходСокращенная</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаНаКассовыйРасход</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗачета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопСубконтоАвансов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/МЗ_ОС_Услуги/АБК_ПоступлениеТРУ_ЗачетАвансаПоДокументамИОстаткам/Documents/ФормированиеВложенийВФинансовыеАктивы/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура АБК_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)  
	Если Параметры.Ключ.Пустая() Тогда
		АБК_ДобавитьЭлементыЗачетаАвансаПоДокументамИОстаткам();    
	КонецЕсли;
КонецПроцедуры                                                      

&НаСервере
Процедура АБК_ПриЧтенииНаСервереПеред(ТекущийОбъект)
	АБК_ДобавитьЭлементыЗачетаАвансаПоДокументамИОстаткам();
КонецПроцедуры

&НаСервере
Процедура АБК_ДобавитьЭлементыЗачетаАвансаПоДокументамИОстаткам()
	Если Элементы.Найти("ЗачетАвансовПоДокументамИОстаткам_Страница") = Неопределено Тогда
		
		НовСтраница = Элементы.Вставить("ЗачетАвансовПоДокументамИОстаткам_Страница",Тип("ГруппаФормы"),Элементы.ЗачетАвансов_Страницы);
		НовСтраница.Вид = ВидГруппыФормы.Страница;
		НовСтраница.Заголовок = "Зачет авансов по документам и остаткам";
		
		НовТаблица = Элементы.Добавить("ЗачетАвансовПоДокументамИОстаткам", Тип("ТаблицаФормы"),НовСтраница);
		НовТаблица.ПутьКДанным = "Объект.ЗачетАвансовПоДокументамИОстаткам";
		
		НовЭл = Элементы.Добавить("ЗачетАвансовПоДокументамИОстаткам_ДокументАванса",Тип("ПолеФормы"),НовТаблица);
		НовЭл.ПутьКДанным = "Объект.ЗачетАвансовПоДокументамИОстаткам.ДокументАванса";
		НовЭл.Вид = ВидПоляФормы.ПолеВвода; 
		НовЭл.УстановитьДействие("НачалоВыбора","ЗачетАвансовПоДокументамИОстаткамДокументАвансаНачалоВыбора");
		НовЭл.УстановитьДействие("ОбработкаВыбора","ЗачетАвансовПоДокументамИОстаткамДокументАвансаОбработкаВыбора");
		
		НовЭл = Элементы.Добавить("ЗачетАвансовПоДокументамИОстаткам_КФО",Тип("ПолеФормы"),НовТаблица);
		НовЭл.ПутьКДанным = "Объект.ЗачетАвансовПоДокументамИОстаткам.КФО";
		НовЭл.Вид = ВидПоляФормы.ПолеВвода;
		
		НовЭл = Элементы.Добавить("ЗачетАвансовПоДокументамИОстаткам_КПС",Тип("ПолеФормы"),НовТаблица);
		НовЭл.ПутьКДанным = "Объект.ЗачетАвансовПоДокументамИОстаткам.КПС";
		НовЭл.Вид = ВидПоляФормы.ПолеВвода;
		
		НовЭл = Элементы.Добавить("ЗачетАвансовПоДокументамИОстаткам_КЭК",Тип("ПолеФормы"),НовТаблица);
		НовЭл.ПутьКДанным = "Объект.ЗачетАвансовПоДокументамИОстаткам.КЭК";
		НовЭл.Вид = ВидПоляФормы.ПолеВвода;
		
		НовЭл = Элементы.Добавить("ЗачетАвансовПоДокументамИОстаткам_ДополнительнаяАналитикаСчета",Тип("ПолеФормы"),НовТаблица);
		НовЭл.ПутьКДанным = "Объект.ЗачетАвансовПоДокументамИОстаткам.ДопСубконтоАвансов";
		НовЭл.Вид = ВидПоляФормы.ПолеВвода;
		
		НовЭл = Элементы.Добавить("ЗачетАвансовПоДокументамИОстаткам_СуммаЗачета",Тип("ПолеФормы"),НовТаблица);
		НовЭл.ПутьКДанным = "Объект.ЗачетАвансовПоДокументамИОстаткам.СуммаЗачета";
		НовЭл.Вид = ВидПоляФормы.ПолеВвода;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗачетАвансовПоДокументамИОстаткамДокументАвансаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	УчетРасчетовКлиент.АБК_ДокументАвансаПоДокументамИОстаткамНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачетАвансовПоДокументамИОстаткамДокументАвансаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
	
	УчетРасчетовКлиент.АБК_ДокументАвансаПоДокументамИОстаткамОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка, ЭтаФорма, Объект);
	
КонецПроцедуры
